Repository: fakiho/Whisked
Catalog: Whisked/Resources/*.lproj/Localizable.strings
Languages: fr

# navigation.back
source: Back
fr: Retour

# navigation.done
source: Done
fr: Terminé

# navigation.cancel
source: Cancel
fr: Annuler

# navigation.retry
source: Retry
fr: Réessayer

# navigation.close
source: Close
fr: Fermer

# categories.title
source: Meal Categories
fr: Catégories de Repas

# categories.navigation_title
source: Meal Categories
fr: Catégories de Repas

# categories.loading
source: Exploring meal categories...
fr: Exploration des catégories de repas...

# categories.loading_description
source: Loading delicious options
fr: Chargement des options délicieuses

# categories.load_more
source: Load More
fr: Charger Plus

# categories.loading_more
source: Loading more categories...
fr: Chargement de plus de catégories...

# categories.empty.title
source: No Categories Available
fr: Aucune Catégorie Disponible

# categories.empty.description
source: No meal categories could be loaded at this time.
fr: Aucune catégorie de repas n'a pu être chargée pour le moment.

# categories.error.title
source: Unable to Load Categories
fr: Impossible de Charger les Catégories

# categories.error.description
source: Please check your internet connection and try again.
fr: Veuillez vérifier votre connexion internet et réessayer.

# categories.retry_button
source: Retry
fr: Réessayer

# meals.search_placeholder
source: Search meals...
fr: Rechercher des repas...

# meals.loading
source: Exploring %@ recipes...
fr: Exploration des recettes %@...

# meals.loading_description
source: Fetching complete meal catalog
fr: Récupération du catalogue complet de repas

# meals.error.title
source: Oops!
fr: Oups !

# meals.error.default
source: Something went wrong while loading meals
fr: Une erreur s'est produite lors du chargement des repas

# meals.try_again
source: Try Again
fr: Réessayer

# meals.tap_to_view
source: Tap to view recipe
fr: Appuyer pour voir la recette

# meal_detail.ingredients
source: Ingredients
fr: Ingrédients

# meal_detail.favorite.add
source: Add to Favorites
fr: Ajouter aux Favoris

# meal_detail.favorite.remove
source: Remove from Favorites
fr: Retirer des Favoris

# meal_detail.favorite.added
source: Added to Favorites
fr: Ajouté aux Favoris

# meal_detail.favorite.removed
source: Removed from Favorites
fr: Retiré des Favoris

# meal_detail.loading
source: Loading recipe details...
fr: Chargement des détails de la recette...

# meal_detail.error.title
source: Recipe Not Found
fr: Recette Introuvable

# meal_detail.error.description
source: Unable to load recipe details. Please try again.
fr: Impossible de charger les détails de la recette. Veuillez réessayer.

# favorites.title
source: Favorites
fr: Favoris

# favorites.navigation_title
source: Favorites
fr: Favoris

# favorites.count_zero
source: No favorite meals yet
fr: Aucun repas favori pour le moment

# favorites.count_one
source: 1 favorite meal
fr: 1 repas favori

# favorites.count_many
source: %d favorite meals
fr: %d repas favoris

# favorites.empty.title
source: No Favorites Yet
fr: Aucun Favori

# favorites.empty.description
source: Meals you favorite will appear here for easy access.
fr: Les repas que vous mettez en favori apparaîtront ici pour un accès facile.

# favorites.empty.browse
source: Browse Recipes
fr: Parcourir les Recettes

# favorites.card_title
source: Favorites
fr: Favoris

# favorites.card_description
source: Your saved recipes
fr: Vos recettes sauvegardées

# loading.default
source: Loading...
fr: Chargement...

# loading.please_wait
source: Please wait...
fr: Veuillez patienter...

source: Loading categories...
fr: Chargement des catégories...

source: Loading meals...
fr: Chargement des repas...

source: Loading recipe...
fr: Chargement de la recette...

# error.network.title
source: Connection Error
fr: Erreur de Connexion

# error.network.description
source: Please check your internet connection and try again.
fr: Veuillez vérifier votre connexion internet et réessayer.

# error.server.title
source: Server Error
fr: Erreur Serveur

# error.server.description
source: The server is experiencing issues. Please try again later.
fr: Le serveur rencontre des problèmes. Veuillez réessayer plus tard.

# error.timeout.title
source: Request Timeout
fr: Délai d'Attente Dépassé

# error.timeout.description
source: The request took too long to complete. Please try again.
fr: La requête a pris trop de temps. Veuillez réessayer.

# error.unknown.title
source: Something Went Wrong
fr: Une Erreur s'est Produite

# error.unknown.description
source: An unexpected error occurred. Please try again.
fr: Une erreur inattendue s'est produite. Veuillez réessayer.

# error.meals.no_internet
source: No internet connection. Please check your network and try again.
fr: Aucune connexion internet. Veuillez vérifier votre réseau et réessayer.

# error.meals.timeout
source: Request timed out. Please try again.
fr: Délai d'attente de la requête dépassé. Veuillez réessayer.

# error.meals.cancelled
source: Request was cancelled. Please try again.
fr: La requête a été annulée. Veuillez réessayer.

# error.meals.cannot_reach_server
source: Cannot reach the server. Please try again later.
fr: Impossible d'atteindre le serveur. Veuillez réessayer plus tard.

# error.meals.network_error
source: Network error occurred. Please try again.
fr: Erreur réseau survenue. Veuillez réessayer.

# error.meals.server_error
source: Server error (%d). Please try again later.
fr: Erreur serveur (%d). Veuillez réessayer plus tard.

# error.meals.decoding_error
source: Unable to process server response. Please try again.
fr: Impossible de traiter la réponse du serveur. Veuillez réessayer.

# error.meals.no_meals_found
source: No meals found. Please try again later.
fr: Aucun repas trouvé. Veuillez réessayer plus tard.

# error.meals.unexpected_error
source: An unexpected error occurred. Please try again.
fr: Une erreur inattendue s'est produite. Veuillez réessayer.

# accessibility.meal_list
source: Meal list
fr: Liste des repas

# accessibility.meal_list_hint
source: Swipe up and down to browse meal recipes
fr: Glissez vers le haut et le bas pour parcourir les recettes

# accessibility.favorited
source: Favorited
fr: Mis en favori

# accessibility.loading_meals
source: Loading %@ meals
fr: Chargement des repas %@

# accessibility.loading_hint
source: Please wait while we fetch the complete meal catalog
fr: Veuillez patienter pendant que nous récupérons le catalogue complet de repas

# accessibility.error_loading
source: Error loading meals
fr: Erreur lors du chargement des repas

# accessibility.retry_hint
source: Tap try again to reload the meal list
fr: Appuyez sur réessayer pour recharger la liste des repas

# accessibility.category_card
source: Category card
fr: Carte de catégorie

# accessibility.category_card_hint
source: Tap to view meals in this category
fr: Appuyez pour voir les repas de cette catégorie

# accessibility.favorites_card
source: Favorites card
fr: Carte des favoris

# accessibility.favorites_card_hint
source: Tap to view your favorite meals
fr: Appuyez pour voir vos repas favoris

# accessibility.category_image
source: Category image
fr: Image de catégorie

# accessibility.loading_view
source: Loading categories
fr: Chargement des catégories

# accessibility.empty_view
source: Empty categories view
fr: Vue des catégories vides

# accessibility.error_view
source: Error loading categories view
fr: Vue d'erreur de chargement des catégories

# category.breakfast
source: Breakfast
fr: Petit-déjeuner

# category.chicken
source: Chicken
fr: Poulet

# category.pasta
source: Pasta
fr: Pâtes

# category.seafood
source: Seafood
fr: Fruits de Mer

# category.dessert.description
source: Sweet treats and desserts from around the world
fr: Friandises sucrées et desserts du monde entier

# category.breakfast.description
source: Start your day right with these breakfast recipes
fr: Commencez bien votre journée avec ces recettes de petit-déjeuner

# category.chicken.description
source: Delicious chicken dishes from various cuisines
fr: Délicieux plats de poulet de diverses cuisines

# category.pasta.description
source: Italian pasta dishes and noodle recipes
fr: Plats de pâtes italiennes et recettes de nouilles

# category.seafood.description
source: Fresh seafood and fish recipes
fr: Recettes fraîches de fruits de mer et de poisson
